# GetFileSize

## Description
```pascal
FUNCTION GetFileSize(VAR FilePath : STRING) : LONGINT;
```

```python

def vs.GetFileSize(FilePath):
    return (LONGINT, FilePath)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|FilePath|STRING||

## Returns
Returns the size of a file in bytes.

## Version
Availability: from Vectorworks 2017
## Category
* File I/O